package com.zs.ee;


public class EnterprisesRisktest {

	public  String[][] enterprisesRisktest() {
		/**
		 * 测试数据，暂时没有使用到数据库
		 * [企业1]
		 * [检测点11] 氮气出塔温度 的历史数据 30条
		 *
		 */
		double[] data11 =
				{27.8,
						28,
						27.9,
						29,
						27.10,
						30,
						27.11,
						31,
						27.12,
						32,
						27.13,
						33,
						27.14,
						34,
						27.15,
						35,
						27.16,
						36,
						27.9,
						28,
						27.9,
						29,
						27.10,
						30,
						27.11,
						31,
						27.12,
						32,
						27.13,
						33};
		/**
		 *
		 * [企业1]
		 * [检测点12] 氮气出塔流量 的历史数据30条
		 *
		 */
		double[] data12 =
				{496.272,
						496.273,
						496.274,
						496.275,
						496.276,
						496.277,
						496.278,
						496.279,
						496.280,
						496.281,
						496.282,
						496.283,
						496.284,
						496.285,
						496.286,
						496.287,
						496.288,
						496.289,
						496.290,
						496.291,
						496.292,
						496.293,
						496.294,
						496.295,
						496.296,
						496.297,
						496.298,
						496.299,
						496.300,
						496.301,};
		/**
		 *
		 * [企业2]
		 * [检测点21] 液位 的历史数据30条
		 *
		 */
		double[] data21 =
				{966.146,
						964.844,
						966.147,
						964.845,
						966.148,
						964.846,
						966.149,
						964.847,
						966.150,
						964.848,
						966.151,
						964.849,
						966.152,
						964.850,
						966.153,
						964.851,
						966.154,
						964.852,
						966.155,
						964.853,
						966.156,
						964.854,
						966.157,
						964.855,
						966.158,
						964.856,
						966.159,
						964.857,
						966.160,
						964.858,};
		/**
		 *
		 * [企业2]
		 * [检测点22] 压力  的历史数据30条
		 *
		 */
		double[] data22 =
				{320.139,
						320.023,
						320.093,
						320.209,
						320.325,
						320.441,
						320.557,
						320.673,
						320.789,
						320.905,
						320.1021,
						320.1137,
						320.1253,
						320.1369,
						320.1485,
						320.1601,
						320.1717,
						320.1833,
						320.1949,
						320.2065,
						320.2181,
						320.2297,
						320.2413,
						320.2529,
						320.2645,
						320.2761,
						320.2877,
						320.2993,
						320.3109,
						320.3225,};




		double riskdata11;
		double riskdata12;


		double riskdata21;
		double riskdata22;

		double corRisk1;

		double corRisk2;

		EnterprisesRiskPredict test1 = new EnterprisesRiskPredict();




		//输入检测点信息：
		//|1.时间|2.企业ID|3.检测点名称|4.监测点实时值|5.监测点高高报警线|6.监测点低低报警线|7.监测点高报警线|8.监测点低报警线|9.监测点预测值|
		riskdata11 = test1.predictSimple(10, 1, 1,data11, 28, 0, 90, 0, 0.32);   //检测点1预测值
		riskdata12 = test1.predictSimple(10, 2, 1,data12, 490, 0, 90, 0, 0.68);   //检测点2预测值



		riskdata21 = test1.predictSimple(10, 3, 1,data21, 965, 0, 90, 0, 0.45);   //检测点1预测值
		riskdata22 = test1.predictSimple(10, 4, 1,data22, 319, 0, 90, 0, 0.55);   //检测点2预测值



		corRisk1 = test1.riskDisplay(riskdata11,riskdata12); //企业1
		String corRiskstr1= ""+corRisk1;
		corRisk2 = test1.riskDisplay(riskdata21,riskdata22);//企业2
		String corRiskstr2= ""+corRisk2;


		String[][] enterprisesRisk ={
				{"1","中天氟硅",corRiskstr1,},
				{"2","衢州硅宝",corRiskstr2,},
		};

		return enterprisesRisk;

	}



}

